In [1]:
import pandas as pd

In [2]:
person = {
    "first" : ["Iqram", "Max", "Dove", "Abdul"],
    "last" : ["Haris", "McReary", "Shampoo", "Haris"],
    "email": ["IqramHaris@yahoo.com", "MaxMcReary@gmail.com", "DoveShampoo@email.com", "AbdulHaris@email.com"]
}

In [3]:
df1 = pd.DataFrame(person)

In [4]:
df1

   first     last                  email
0  Iqram    Haris   IqramHaris@yahoo.com
1    Max  McReary   MaxMcReary@gmail.com
2   Dove  Shampoo  DoveShampoo@email.com
3  Abdul    Haris   AbdulHaris@email.com

In [5]:
df1.set_index('first')

          last                  email
first
Iqram    Haris   IqramHaris@yahoo.com
Max    McReary   MaxMcReary@gmail.com
Dove   Shampoo  DoveShampoo@email.com
Abdul    Haris   AbdulHaris@email.com

In [8]:
filt = df1['first'] == 'Iqram'

In [9]:
df1.loc[filt]

   first   last                 email
0  Iqram  Haris  IqramHaris@yahoo.com

In [10]:
df1

   first     last                  email
0  Iqram    Haris   IqramHaris@yahoo.com
1    Max  McReary   MaxMcReary@gmail.com
2   Dove  Shampoo  DoveShampoo@email.com
3  Abdul    Haris   AbdulHaris@email.com

In [11]:
df1.columns

Index(['first', 'last', 'email'], dtype='object')

In [12]:
df1.columns = ['first name', 'last_name', 'email']

In [13]:
df1

  first name last_name                  email
0      Iqram     Haris   IqramHaris@yahoo.com
1        Max   McReary   MaxMcReary@gmail.com
2       Dove   Shampoo  DoveShampoo@email.com
3      Abdul     Haris   AbdulHaris@email.com

In [14]:
df1.columns = [x.upper() for x in df1]

In [15]:
df1

  FIRST NAME LAST_NAME                  EMAIL
0      Iqram     Haris   IqramHaris@yahoo.com
1        Max   McReary   MaxMcReary@gmail.com
2       Dove   Shampoo  DoveShampoo@email.com
3      Abdul     Haris   AbdulHaris@email.com

In [16]:
df1.columns = df1.columns.str.replace(' ', '_')

In [17]:
df1

  FIRST_NAME LAST_NAME                  EMAIL
0      Iqram     Haris   IqramHaris@yahoo.com
1        Max   McReary   MaxMcReary@gmail.com
2       Dove   Shampoo  DoveShampoo@email.com
3      Abdul     Haris   AbdulHaris@email.com

In [18]:
df1.columns = [x.lower() for x in df1]

In [19]:
df1

  first_name last_name                  email
0      Iqram     Haris   IqramHaris@yahoo.com
1        Max   McReary   MaxMcReary@gmail.com
2       Dove   Shampoo  DoveShampoo@email.com
3      Abdul     Haris   AbdulHaris@email.com

In [21]:
df1.rename(columns = {'first_name': 'first', 'last_name' : 'last'}, inplace = True)

In [22]:
df1

   first     last                  email
0  Iqram    Haris   IqramHaris@yahoo.com
1    Max  McReary   MaxMcReary@gmail.com
2   Dove  Shampoo  DoveShampoo@email.com
3  Abdul    Haris   AbdulHaris@email.com

In [24]:
df1.loc[3] = ['Iqram', 'Fahromi', 'IqramFahromi@email.com']

In [25]:
df1

   first     last                   email
0  Iqram    Haris    IqramHaris@yahoo.com
1    Max  McReary    MaxMcReary@gmail.com
2   Dove  Shampoo   DoveShampoo@email.com
3  Iqram  Fahromi  IqramFahromi@email.com

In [27]:
df1.loc[3, ['first','last', 'email']] = ['Abdul', 'Haris', 'AbdulHaris@email.com']

In [29]:
df1

   first     last                  email
0  Iqram    Haris   IqramHaris@yahoo.com
1    Max  McReary   MaxMcReary@gmail.com
2   Dove  Shampoo  DoveShampoo@email.com
3  Abdul    Haris   AbdulHaris@email.com

In [30]:
df1.loc[0, ['last']] = 'smit'

In [31]:
df1

   first     last                  email
0  Iqram     smit   IqramHaris@yahoo.com
1    Max  McReary   MaxMcReary@gmail.com
2   Dove  Shampoo  DoveShampoo@email.com
3  Abdul    Haris   AbdulHaris@email.com

In [32]:
df1.at[0, ['last']] = 'Haris'

In [33]:
df1

   first     last                  email
0  Iqram    Haris   IqramHaris@yahoo.com
1    Max  McReary   MaxMcReary@gmail.com
2   Dove  Shampoo  DoveShampoo@email.com
3  Abdul    Haris   AbdulHaris@email.com

In [34]:
filt = (df1['first'] == 'Dove')

In [35]:
df1[filt]

  first     last                  email
2  Dove  Shampoo  DoveShampoo@email.com

In [39]:
df1[filt] ['first'] = 'Oved'

C:\Users\acer\AppData\Local\Temp/ipykernel_2196/3699254136.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1[filt] ['first'] = 'Oved'

In [41]:
filt2 = (df1['first'] == 'Dove')
df1.loc[filt2, ['last']] = 'Oved'

In [42]:
df1

   first     last                  email
0  Iqram    Haris   IqramHaris@yahoo.com
1    Max  McReary   MaxMcReary@gmail.com
2   Dove     Oved  DoveShampoo@email.com
3  Abdul    Haris   AbdulHaris@email.com

In [43]:
"""
apply
map
applymap
replace
"""

'\napply\nmap\napplymap\nreplace\n'

In [48]:
df1['email'].apply(len)

0    20
1    20
2    21
3    20
Name: email, dtype: int64

In [49]:
def huruf_besar(email):
    return email.upper()

In [50]:
df1['email'].apply(huruf_besar)

0     IQRAMHARIS@YAHOO.COM
1     MAXMCREARY@GMAIL.COM
2    DOVESHAMPOO@EMAIL.COM
3     ABDULHARIS@EMAIL.COM
Name: email, dtype: object

In [51]:
df1

   first     last                  email
0  Iqram    Haris   IqramHaris@yahoo.com
1    Max  McReary   MaxMcReary@gmail.com
2   Dove     Oved  DoveShampoo@email.com
3  Abdul    Haris   AbdulHaris@email.com

In [52]:
df1['email'] = df1['email'].apply(huruf_besar)

In [53]:
df1

   first     last                  email
0  Iqram    Haris   IQRAMHARIS@YAHOO.COM
1    Max  McReary   MAXMCREARY@GMAIL.COM
2   Dove     Oved  DOVESHAMPOO@EMAIL.COM
3  Abdul    Haris   ABDULHARIS@EMAIL.COM

In [55]:
df1['email'] = df1['email'].apply(lambda x: x.lower())

In [56]:
df1

   first     last                  email
0  Iqram    Haris   iqramharis@yahoo.com
1    Max  McReary   maxmcreary@gmail.com
2   Dove     Oved  doveshampoo@email.com
3  Abdul    Haris   abdulharis@email.com

In [57]:
df1.apply(len)

first    4
last     4
email    4
dtype: int64

In [58]:
df1.apply(len, axis = 'columns')

0    3
1    3
2    3
3    3
dtype: int64

In [59]:
len(df1['email'])

4

In [61]:
df1.apply(pd.Series.min)

first                   Abdul
last                    Haris
email    abdulharis@email.com
dtype: object

In [62]:
df1.apply(lambda x: x.min())

first                   Abdul
last                    Haris
email    abdulharis@email.com
dtype: object

In [63]:
df1.applymap(len)

   first  last  email
0      5     5     20
1      3     7     20
2      4     4     21
3      5     5     20

In [66]:
df1.applymap(str.lower)

   first     last                  email
0  iqram    haris   iqramharis@yahoo.com
1    max  mcreary   maxmcreary@gmail.com
2   dove     oved  doveshampoo@email.com
3  abdul    haris   abdulharis@email.com

In [70]:
df1['first'].map({'Iqram': 'marqi', 'Max': 'xam', 'Dove': 'oved'})

0    marqi
1      xam
2     oved
3      NaN
Name: first, dtype: object

In [71]:
df1['first'].replace({'Iqram':'marqi', 'Max':'xam', 'Dove': 'oved'})

0    marqi
1      xam
2     oved
3    Abdul
Name: first, dtype: object

In [72]:
df1['first'] = df1['first'].replace({'Iqram':'marqi', 'Max':'xam', 'Dove': 'oved'})

In [73]:
df1

   first     last                  email
0  marqi    Haris   iqramharis@yahoo.com
1    xam  McReary   maxmcreary@gmail.com
2   oved     Oved  doveshampoo@email.com
3  Abdul    Haris   abdulharis@email.com